name: "sumen"
backend: "python"
max_batch_size: 8

input [
  {
    name: "input_image"
    data_type: TYPE_UINT8
    dims: [-1]
  }
]
output [
  {
    name: "latex_string"
    data_type: TYPE_STRING
    dims: [ -1 ]
  }
]

instance_group [
  {
    count: 2
    kind: KIND_GPU
  }
]

dynamic_batching {
  max_queue_delay_microseconds: 100
}